---
kind: method
id: M:Autodesk.Revit.DB.DimensionType.GetSpecTypeId
source: html/bcdcd878-9956-0531-deac-e68dd6f7149a.htm
---
# Autodesk.Revit.DB.DimensionType.GetSpecTypeId Method

Gets the spec of this dimension style.

## Syntax (C#)
```csharp
public ForgeTypeId GetSpecTypeId()
```

## Returns
Identifier of the spec.

## Remarks
The spec will represent either length, angle or slope.